; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star6 - direction
	Star11 - direction
	Star8 - direction
	GroundStation5 - direction
	Star10 - direction
	GroundStation9 - direction
	Star2 - direction
	GroundStation3 - direction
	Star7 - direction
	Star0 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star7)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Phenomenon13)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Star17 spectrograph0)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite2 star12 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star12)
   goals met: 0 of 9
5. (take_image satellite2 star12 instrument2 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 1 of 9
6. (turn_to satellite2 planet18 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet18)
   goals met: 1 of 9
7. (take_image satellite2 planet18 instrument2 image1)
   added: (have_image planet18 image1)
   goals met: 2 of 9
8. (turn_to satellite2 planet16 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet16)
   goals met: 2 of 9
9. (take_image satellite2 planet16 instrument2 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 3 of 9
10. (turn_to satellite1 star0 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star0)
   goals met: 4 of 9
11. (turn_to satellite2 star14 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star14)
   goals met: 4 of 9
12. (take_image satellite2 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 5 of 9
13. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 5 of 9
14. (take_image satellite2 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 6 of 9
15. (turn_to satellite2 star17 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star17)
   goals met: 6 of 9
16. (take_image satellite2 star17 instrument2 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 7 of 9
17. (turn_to satellite2 phenomenon13 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 phenomenon13)
   goals met: 8 of 9
18. (take_image satellite2 phenomenon13 instrument2 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 9 of 9
